{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"dtype": "float32", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unit_forget_bias": true, "trainable": true, "units": 6, "implementation": 1, "recurrent_constraint": null, "stateful": true, "kernel_regularizer": null, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "dropout": 0.0, "bias_regularizer": null, "go_backwards": false, "batch_input_shape": [1, 1, 1], "return_state": false, "kernel_constraint": null, "bias_constraint": null, "recurrent_dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "lstm_1", "use_bias": true, "activity_regularizer": null, "activation": "tanh", "unroll": false}, "class_name": "LSTM"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "units": 1, "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_1", "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}]}, "class_name": "Sequential"}